---
kind: type
id: T:Autodesk.Revit.DB.ViewPlacementOnSheetStatus
source: html/f05c1c2c-b8d6-b9f3-d96c-bf24f5f0f6bf.htm
---
# Autodesk.Revit.DB.ViewPlacementOnSheetStatus

Indicates whether the View is placed on a Sheet.

## Syntax (C#)
```csharp
public enum ViewPlacementOnSheetStatus
```

## Remarks
Some Views can be placed on one or more Sheets completely or partially.
 For example, a Schedule divided in segments, and only some of them are placed on Sheets.